ChibiOS/ChibiOS/os/hal/ports/STM32/STM32C0xx/hal_lld.h
/*
    ChibiOS - Copyright (C) 2006..2022 Giovanni Di Sirio

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.f
*/

/**
 * @file    STM32C0xx/hal_lld.h
 * @brief   STM32C0xx HAL subsystem low level driver header.
 * @pre     This module requires the following macros to be defined in the
 *          @p board.h file:
 *          - STM32_LSECLK.
 *          - STM32_LSEDRV.
 *          - STM32_LSE_BYPASS (optionally).
 *          - STM32_HSECLK.
 *          - STM32_HSE_BYPASS (optionally).
 *          .
 *          One of the following macros must also be defined:
 *          - STM32C011xx, STM32C031xx.
 *          - STM32C051xx, STM32C071xx.
 *          - STM32C091xx, STM32C092xx.
 *          .
 *
 * @addtogroup HAL
 * @{
 */

#ifndef HAL_LLD_H
#define HAL_LLD_H

#include "stm32_registry.h"

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @brief   Requires use of SPIv2 driver model.
 */
#define HAL_LLD_SELECT_SPI_V2           TRUE

/**
 * @name    Platform identification
 * @{
 */
#if defined(STM32C011xx) || defined(__DOXYGEN__)
#define PLATFORM_NAME           "STM32C0 Entry-level Mainstream MCU"

#elif defined(STM32C031xx)
#define PLATFORM_NAME           "STM32C0 Entry-level Mainstream MCU"

#elif defined(STM32C051xx)
#define PLATFORM_NAME           "STM32C0 Entry-level Mainstream MCU"

#elif defined(STM32C071xx)
#define PLATFORM_NAME           "STM32C0 Entry-level Mainstream MCU with USB"

#elif defined(STM32C091xx)
#define PLATFORM_NAME           "STM32C0 Entry-level Mainstream MCU with FDCAN"

#elif defined(STM32C092xx)
#define PLATFORM_NAME           "STM32C0 Entry-level Mainstream MCU with FDCAN"

#else
#error "STM32C0 device not specified"
#endif

/**
 * @brief   Sub-family identifier.
 */
#if !defined(STM32C0XX) || defined(__DOXYGEN__)
#define STM32C0XX
#endif
/** @} */

/**
 * @name   Clock points names
 * @{
 */
#define CLK_SYSCLK              0U
#define CLK_HSISYSCLK           1U
#define CLK_HSIKERCLK           2U
#define CLK_HSIUSB48CLK         3U
#define CLK_HCLK                4U
#define CLK_PCLK                5U
#define CLK_PCLKTIM             6U
#define CLK_MCO                 7U
#define CLK_MCO2                8U
#define CLK_ARRAY_SIZE          9U
/** @} */

/**
 * @name    RCC_CR register bits definitions
 * @{
 */
#define STM32_HSIDIV_MASK       (7U << 11)
#define STM32_HSIDIV_FIELD(n)   ((n) << 11)
#define STM32_HSIDIV_DIV1       STM32_HSIDIV_FIELD(0U)
#define STM32_HSIDIV_DIV2       STM32_HSIDIV_FIELD(1U)
#define STM32_HSIDIV_DIV4       STM32_HSIDIV_FIELD(2U)
#define STM32_HSIDIV_DIV8       STM32_HSIDIV_FIELD(3U)
#define STM32_HSIDIV_DIV16      STM32_HSIDIV_FIELD(4U)
#define STM32_HSIDIV_DIV32      STM32_HSIDIV_FIELD(5U)
#define STM32_HSIDIV_DIV64      STM32_HSIDIV_FIELD(6U)
#define STM32_HSIDIV_DIV128     STM32_HSIDIV_FIELD(7U)

#define STM32_HSIKER_MASK       (7U << 5)
#define STM32_HSIKER_FIELD(n)   ((n) << 5)
#define STM32_HSIKER_DIV1       STM32_HSIKER_FIELD(0U)
#define STM32_HSIKER_DIV2       STM32_HSIKER_FIELD(1U)
#define STM32_HSIKER_DIV3       STM32_HSIKER_FIELD(2U)
#define STM32_HSIKER_DIV4       STM32_HSIKER_FIELD(3U)
#define STM32_HSIKER_DIV5       STM32_HSIKER_FIELD(4U)
#define STM32_HSIKER_DIV6       STM32_HSIKER_FIELD(5U)
#define STM32_HSIKER_DIV7       STM32_HSIKER_FIELD(6U)
#define STM32_HSIKER_DIV8       STM32_HSIKER_FIELD(7U)

#define STM32_SYSDIV_MASK       (7U << 2)
#define STM32_SYSDIV_FIELD(n)   ((n) << 2)
#if STM32_RCC_HAS_SYSDIV || defined(__DOXYGEN__)
#define STM32_SYSDIV_DIV1       STM32_SYSDIV_FIELD(0U)
#define STM32_SYSDIV_DIV2       STM32_SYSDIV_FIELD(1U)
#define STM32_SYSDIV_DIV3       STM32_SYSDIV_FIELD(2U)
#define STM32_SYSDIV_DIV4       STM32_SYSDIV_FIELD(3U)
#define STM32_SYSDIV_DIV5       STM32_SYSDIV_FIELD(4U)
#define STM32_SYSDIV_DIV6       STM32_SYSDIV_FIELD(5U)
#define STM32_SYSDIV_DIV7       STM32_SYSDIV_FIELD(6U)
#define STM32_SYSDIV_DIV8       STM32_SYSDIV_FIELD(7U)
#endif
/** @} */

/**
 * @name    RCC_CFGR register bits definitions
 * @{
 */
#define STM32_SW_MASK           (7U << 0)
#define STM32_SW_HSISYS         (0U << 0)
#define STM32_SW_HSE            (1U << 0)
#define STM32_SW_HSIUSB48       (2U << 0)
#define STM32_SW_LSI            (3U << 0)
#define STM32_SW_LSE            (4U << 0)

#define STM32_MCO2SEL_MASK      (7U << 16)
#define STM32_MCO2SEL_FIELD(n)  ((n) << 16)
#define STM32_MCO2SEL_NOCLOCK   STM32_MCO2SEL_FIELD(0U)
#define STM32_MCO2SEL_SYSCLK    STM32_MCO2SEL_FIELD(1U)
#define STM32_MCO2SEL_HSI48     STM32_MCO2SEL_FIELD(3U)
#define STM32_MCO2SEL_HSE       STM32_MCO2SEL_FIELD(4U)
#define STM32_MCO2SEL_LSI       STM32_MCO2SEL_FIELD(6U)
#define STM32_MCO2SEL_LSE       STM32_MCO2SEL_FIELD(7U)
#define STM32_MCO2SEL_HSIUSB48  STM32_MCO2SEL_FIELD(8U)

#define STM32_MCO2PRE_MASK      (7U << 20)
#define STM32_MCO2PRE_FIELD(n)  ((n) << 20)
#define STM32_MCO2PRE_DIV1      STM32_MCO2PRE_FIELD(0U)
#define STM32_MCO2PRE_DIV2      STM32_MCO2PRE_FIELD(1U)
#define STM32_MCO2PRE_DIV4      STM32_MCO2PRE_FIELD(2U)
#define STM32_MCO2PRE_DIV8      STM32_MCO2PRE_FIELD(3U)
#define STM32_MCO2PRE_DIV16     STM32_MCO2PRE_FIELD(4U)
#define STM32_MCO2PRE_DIV32     STM32_MCO2PRE_FIELD(5U)
#define STM32_MCO2PRE_DIV64     STM32_MCO2PRE_FIELD(6U)
#define STM32_MCO2PRE_DIV128    STM32_MCO2PRE_FIELD(7U)
#if STM32_RCC_HAS_MCODIVEXT || defined(__DOXYGEN__)
#define STM32_MCO2PRE_DIV256    STM32_MCO2PRE_FIELD(8U)
#define STM32_MCO2PRE_DIV512    STM32_MCO2PRE_FIELD(9U)
#define STM32_MCO2PRE_DIV1024   STM32_MCO2PRE_FIELD(10U)
#endif

#define STM32_MCOSEL_MASK       (7U << 16)
#define STM32_MCOSEL_FIELD(n)   ((n) << 16)
#define STM32_MCOSEL_NOCLOCK    STM32_MCOSEL_FIELD(0U)
#define STM32_MCOSEL_SYSCLK     STM32_MCOSEL_FIELD(1U)
#define STM32_MCOSEL_HSI48      STM32_MCOSEL_FIELD(3U)
#define STM32_MCOSEL_HSE        STM32_MCOSEL_FIELD(4U)
#define STM32_MCOSEL_LSI        STM32_MCOSEL_FIELD(6U)
#define STM32_MCOSEL_LSE        STM32_MCOSEL_FIELD(7U)
#define STM32_MCOSEL_HSIUSB48   STM32_MCOSEL_FIELD(8U)

#define STM32_MCOPRE_MASK       (7U << 28)
#define STM32_MCOPRE_FIELD(n)   ((n) << 28)
#define STM32_MCOPRE_DIV1       STM32_MCOPRE_FIELD(0U)
#define STM32_MCOPRE_DIV2       STM32_MCOPRE_FIELD(1U)
#define STM32_MCOPRE_DIV4       STM32_MCOPRE_FIELD(2U)
#define STM32_MCOPRE_DIV8       STM32_MCOPRE_FIELD(3U)
#define STM32_MCOPRE_DIV16      STM32_MCOPRE_FIELD(4U)
#define STM32_MCOPRE_DIV32      STM32_MCOPRE_FIELD(5U)
#define STM32_MCOPRE_DIV64      STM32_MCOPRE_FIELD(6U)
#define STM32_MCOPRE_DIV128     STM32_MCOPRE_FIELD(7U)
#if STM32_RCC_HAS_MCODIVEXT || defined(__DOXYGEN__)
#define STM32_MCOPRE_DIV256     STM32_MCOPRE_FIELD(8U)
#define STM32_MCOPRE_DIV512     STM32_MCOPRE_FIELD(9U)
#define STM32_MCOPRE_DIV1024    STM32_MCOPRE_FIELD(10U)
#endif
/** @} */

/**
 * @name    RCC_CCIPR register bits definitions
 * @{
 */
#define STM32_USART1SEL_MASK    (3U << 0)
#define STM32_USART1SEL_PCLK    (0U << 0)
#define STM32_USART1SEL_SYSCLK  (1U << 0)
#define STM32_USART1SEL_HSIKER  (2U << 0)
#define STM32_USART1SEL_LSE     (3U << 0)

#define STM32_FDCAN1SEL_MASK    (3U << 8)
#define STM32_FDCAN1SEL_PCLK    (0U << 8)
#define STM32_FDCAN1SEL_HSIKER  (0U << 8)
#define STM32_FDCAN1SEL_HSE     (0U << 8)

#define STM32_I2C1SEL_MASK      (3U << 12)
#define STM32_I2C1SEL_PCLK      (0U << 12)
#define STM32_I2C1SEL_SYSCLK    (1U << 12)
#define STM32_I2C1SEL_HSIKER    (2U << 12)

#define STM32_I2S1SEL_MASK      (3U << 14)
#define STM32_I2S1SEL_SYSCLK    (0U << 14)
#define STM32_I2S1SEL_HSIKER    (2U << 14)
#define STM32_I2S1SEL_CKIN      (3U << 14)

#define STM32_ADCSEL_MASK       (3U << 30)
#define STM32_ADCSEL_SYSCLK     (0U << 30)
#define STM32_ADCSEL_HSIKER     (2U << 30)
/** @} */

/**
 * @name    RCC_CCIPR2 register bits definitions
 * @{
 */
#define STM32_USBSEL_MASK       (1U << 12)
#define STM32_USBSEL_HSIUSB48   (0U << 12)
#define STM32_USBSEL_HSE        (1U << 12)
/** @} */

/**
 * @name    RCC_CSR1 register bits definitions
 * @{
 */
#define STM32_RTCSEL_MASK       (3U << 8)
#define STM32_RTCSEL_NOCLOCK    (0U << 8)
#define STM32_RTCSEL_LSE        (1U << 8)
#define STM32_RTCSEL_LSI        (2U << 8)
#define STM32_RTCSEL_HSEDIV     (3U << 8)

#define STM32_LSCOSEL_MASK      (3U << 24)
#define STM32_LSCOSEL_NOCLOCK   (0U << 24)
#define STM32_LSCOSEL_LSI       (1U << 24)
#define STM32_LSCOSEL_LSE       (3U << 24)
/** @} */

