ChibiOS/ChibiOS/os/hal/ports/STM32/STM32C0xx/hal_lld.h
#elif STM32_HSIKER_VALUE == 3
  #define STM32_HSIKER              STM32_HSIKER_DIV3

#elif STM32_HSIKER_VALUE == 4
  #define STM32_HSIKER              STM32_HSIKER_DIV4

#elif STM32_HSIKER_VALUE == 5
  #define STM32_HSIKER              STM32_HSIKER_DIV5

#elif STM32_HSIKER_VALUE == 6
  #define STM32_HSIKER              STM32_HSIKER_DIV6

#elif STM32_HSIKER_VALUE == 7
  #define STM32_HSIKER              STM32_HSIKER_DIV7

#elif STM32_HSIKER_VALUE == 8
  #define STM32_HSIKER              STM32_HSIKER_DIV8

#else
  #error "invalid STM32_HSIKER_VALUE value specified"
#endif

/**
 * @brief   STM32_SYSDIV field.
 */
#if STM32_RCC_HAS_SYSDIV || defined(__DOXYGEN__)
  #if (STM32_SYSDIV_VALUE == 1) || defined(__DOXYGEN__)
    #define STM32_SYSDIV            STM32_SYSDIV_DIV1

  #elif STM32_SYSDIV_VALUE == 2
    #define STM32_SYSDIV            STM32_SYSDIV_DIV2

  #elif STM32_SYSDIV_VALUE == 3
    #define STM32_SYSDIV            STM32_SYSDIV_DIV3

  #elif STM32_SYSDIV_VALUE == 4
    #define STM32_SYSDIV            STM32_SYSDIV_DIV4

  #elif STM32_SYSDIV_VALUE == 5
    #define STM32_SYSDIV            STM32_SYSDIV_DIV5

  #elif STM32_SYSDIV_VALUE == 6
    #define STM32_SYSDIV            STM32_SYSDIV_DIV6

  #elif STM32_SYSDIV_VALUE == 7
    #define STM32_SYSDIV            STM32_SYSDIV_DIV7

  #elif STM32_SYSDIV_VALUE == 8
    #define STM32_SYSDIV            STM32_SYSDIV_DIV8

  #else
    #error "invalid STM32_SYSDIV_VALUE value specified"
  #endif
#else
  #undef STM32_SYSDIV_VALUE         /* Ignoring the setting.*/
  #define STM32_SYSDIV_VALUE        1U
  #define STM32_SYSDIV              0U
#endif

/**
 * @brief   HSISYS clock frequency.
 */
#define STM32_HSISYSCLK             (STM32_HSI48CLK / STM32_HSIDIV_VALUE)

/**
 * @brief   HSIKER clock frequency.
 */
#define STM32_HSIKERCLK             (STM32_HSI48CLK / STM32_HSIKER_VALUE)

/**
 * @brief   System clock source.
 */
#if (STM32_SW == STM32_SW_HSISYS)
  #define STM32_SYSCLK              (STM32_HSISYSCLK / STM32_SYSDIV_VALUE)

#elif (STM32_SW == STM32_SW_HSE)
  #define STM32_SYSCLK              (STM32_HSECLK / STM32_SYSDIV_VALUE)

#elif (STM32_SW == STM32_SW_LSI)
  #define STM32_SYSCLK              (STM32_LSICLK / STM32_SYSDIV_VALUE)

#elif (STM32_SW == STM32_SW_LSE)
  #define STM32_SYSCLK              (STM32_LSECLK / STM32_SYSDIV_VALUE)

#else
#error "invalid STM32_SW value specified"
#endif

/* Bus handlers.*/
#include "stm32_ahb.inc"
#include "stm32_apb.inc"

/*
 * Compatibility definitions.
 */
#define STM32_PCLK1                 STM32_PCLK
#define STM32_PCLK2                 STM32_PCLK

/**
 * @brief   MCO divider clock frequency.
 */
#if (STM32_MCOSEL == STM32_MCOSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_MCODIVCLK           0

#elif STM32_MCOSEL == STM32_MCOSEL_SYSCLK
  #define STM32_MCODIVCLK           STM32_SYSCLK

#elif STM32_MCOSEL == STM32_MCOSEL_HSI48
  #define STM32_MCODIVCLK           STM32_HSI48CLK

#elif STM32_MCOSEL == STM32_MCOSEL_HSE
  #define STM32_MCODIVCLK           STM32_HSECLK

#elif STM32_MCOSEL == STM32_MCOSEL_LSI
  #define STM32_MCODIVCLK           STM32_LSICLK

#elif STM32_MCOSEL == STM32_MCOSEL_LSE
  #define STM32_MCODIVCLK           STM32_LSECLK

#else
  #error "invalid STM32_MCOSEL value specified"
#endif

/**
 * @brief   MCO output pin clock frequency.
 */
#if (STM32_MCOPRE == STM32_MCOPRE_DIV1) || defined(__DOXYGEN__)
  #define STM32_MCOCLK              STM32_MCODIVCLK

#elif STM32_MCOPRE == STM32_MCOPRE_DIV2
  #define STM32_MCOCLK              (STM32_MCODIVCLK / 2)

#elif STM32_MCOPRE == STM32_MCOPRE_DIV4
  #define STM32_MCOCLK              (STM32_MCODIVCLK / 4)

#elif STM32_MCOPRE == STM32_MCOPRE_DIV8
  #define STM32_MCOCLK              (STM32_MCODIVCLK / 8)

#elif STM32_MCOPRE == STM32_MCOPRE_DIV16
  #define STM32_MCOCLK              (STM32_MCODIVCLK / 16)

#elif STM32_MCOPRE == STM32_MCOPRE_DIV32
  #define STM32_MCOCLK              (STM32_MCODIVCLK / 32)

#elif STM32_MCOPRE == STM32_MCOPRE_DIV64
  #define STM32_MCOCLK              (STM32_MCODIVCLK / 64)

#elif STM32_MCOPRE == STM32_MCOPRE_DIV128
  #define STM32_MCOCLK              (STM32_MCODIVCLK / 128)

#else
  #error "invalid STM32_MCOPRE value specified"
#endif

/**
 * @brief   MCO2 divider clock frequency.
 */
#if (STM32_MCO2SEL == STM32_MCO2SEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_MCO2DIVCLK          0

#elif STM32_MCO2SEL == STM32_MCO2SEL_SYSCLK
  #define STM32_MCO2DIVCLK          STM32_SYSCLK

#elif STM32_MCO2SEL == STM32_MCO2SEL_HSI48
  #define STM32_MCO2DIVCLK          STM32_HSI48CLK

#elif STM32_MCO2SEL == STM32_MCO2SEL_HSE
  #define STM32_MCO2DIVCLK          STM32_HSECLK

#elif STM32_MCO2SEL == STM32_MCO2SEL_LSI
  #define STM32_MCO2DIVCLK          STM32_LSICLK

#elif STM32_MCO2SEL == STM32_MCO2SEL_LSE
  #define STM32_MCO2DIVCLK          STM32_LSECLK

#else
  #error "invalid STM32_MCO2SEL value specified"
#endif

/**
 * @brief   MCO2 output pin clock frequency.
 */
#if (STM32_MCO2PRE == STM32_MCO2PRE_DIV1) || defined(__DOXYGEN__)
  #define STM32_MCO2CLK             STM32_MCO2DIVCLK

#elif STM32_MCO2PRE == STM32_MCO2PRE_DIV2
  #define STM32_MCO2CLK             (STM32_MCO2DIVCLK / 2)

#elif STM32_MCO2PRE == STM32_MCO2PRE_DIV4
  #define STM32_MCO2CLK             (STM32_MCO2DIVCLK / 4)

#elif STM32_MCO2PRE == STM32_MCO2PRE_DIV8
  #define STM32_MCO2CLK             (STM32_MCO2DIVCLK / 8)

#elif STM32_MCO2PRE == STM32_MCO2PRE_DIV16
  #define STM32_MCO2CLK             (STM32_MCO2DIVCLK / 16)

#elif STM32_MCO2PRE == STM32_MCO2PRE_DIV32
  #define STM32_MCO2CLK             (STM32_MCO2DIVCLK / 32)

#elif STM32_MCO2PRE == STM32_MCO2PRE_DIV64
  #define STM32_MCO2CLK             (STM32_MCO2DIVCLK / 64)

#elif STM32_MCO2PRE == STM32_MCO2PRE_DIV128
  #define STM32_MCO2CLK             (STM32_MCO2DIVCLK / 128)

#else
  #error "invalid STM32_MCO2PRE value specified"
#endif

/**
 * @brief   RTC clock frequency.
 */
#if (STM32_RTCSEL == STM32_RTCSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_RTCCLK              0

#elif STM32_RTCSEL == STM32_RTCSEL_LSE
  #define STM32_RTCCLK              STM32_LSECLK

#elif STM32_RTCSEL == STM32_RTCSEL_LSI
  #define STM32_RTCCLK              STM32_LSICLK

#elif STM32_RTCSEL == STM32_RTCSEL_HSEDIV
  #define STM32_RTCCLK              (STM32_HSECLK / 32)

#else
  #error "invalid STM32_RTCSEL value specified"
#endif

/**
 * @brief   USART1 clock frequency.
 */
#if (STM32_USART1SEL == STM32_USART1SEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_USART1CLK           hal_lld_get_clock_point(CLK_PCLK)

#elif STM32_USART1SEL == STM32_USART1SEL_SYSCLK
  #define STM32_USART1CLK           hal_lld_get_clock_point(CLK_SYSCLK)

#elif STM32_USART1SEL == STM32_USART1SEL_HSIKER
  #define STM32_USART1CLK           hal_lld_get_clock_point(CLK_HSIKERCLK)

#elif STM32_USART1SEL == STM32_USART1SEL_LSE
  #define STM32_USART1CLK           STM32_LSECLK

#else
  #error "invalid source selected for USART1 clock"
#endif

/**
 * @brief   USART2 clock frequency.
 */
#define STM32_USART2CLK             hal_lld_get_clock_point(CLK_PCLK)

/**
 * @brief   FDCAN1 clock frequency.
 */
#if (STM32_FDCAN1SEL == STM32_FDCAN1SEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_FDCAN1CLK           hal_lld_get_clock_point(CLK_PCLK)

#elif STM32_FDCAN1SEL == STM32_FDCAN1SELL_HSIKER
  #define STM32_FDCAN1CLK           hal_lld_get_clock_point(CLK_HSIKERCLK)

#elif STM32_FDCAN1SEL == STM32_FDCAN1SELL_HSE
  #define STM32_FDCAN1CLK           STM32_HSECLK

#else
  #error "invalid source selected for FDCAN1 clock"
#endif

/**
 * @brief   I2C1 clock frequency.
 */
#if (STM32_I2C1SEL == STM32_I2C1SEL_PCLK) || defined(__DOXYGEN__)
  #define STM32_I2C1CLK             hal_lld_get_clock_point(CLK_PCLK)

